LitchiCheng/stm32f103_Combo/LSM6DSR_I2C_HAL/driver/lsm6dsr_reg.h
int32_t lsm6dsr_read_reg(lsm6dsr_ctx_t *ctx, uint8_t reg, uint8_t* data,
                         uint16_t len);
int32_t lsm6dsr_write_reg(lsm6dsr_ctx_t *ctx, uint8_t reg, uint8_t* data,
                          uint16_t len);

extern float_t lsm6dsr_from_fs2g_to_mg(int16_t lsb);
extern float_t lsm6dsr_from_fs4g_to_mg(int16_t lsb);
extern float_t lsm6dsr_from_fs8g_to_mg(int16_t lsb);
extern float_t lsm6dsr_from_fs16g_to_mg(int16_t lsb);
extern float_t lsm6dsr_from_fs125dps_to_mdps(int16_t lsb);
extern float_t lsm6dsr_from_fs250dps_to_mdps(int16_t lsb);
extern float_t lsm6dsr_from_fs500dps_to_mdps(int16_t lsb);
extern float_t lsm6dsr_from_fs1000dps_to_mdps(int16_t lsb);
extern float_t lsm6dsr_from_fs2000dps_to_mdps(int16_t lsb);
extern float_t lsm6dsr_from_fs4000dps_to_mdps(int16_t lsb);
extern float_t lsm6dsr_from_lsb_to_celsius(int16_t lsb);
extern float_t lsm6dsr_from_lsb_to_nsec(int32_t lsb);

typedef enum {
  LSM6DSR_2g   = 0,
  LSM6DSR_16g  = 1, /* if XL_FS_MODE = ‘1’ -> LSM6DSR_2g */
  LSM6DSR_4g   = 2,
  LSM6DSR_8g   = 3,
} lsm6dsr_fs_xl_t;
int32_t lsm6dsr_xl_full_scale_set(lsm6dsr_ctx_t *ctx, lsm6dsr_fs_xl_t val);
int32_t lsm6dsr_xl_full_scale_get(lsm6dsr_ctx_t *ctx, lsm6dsr_fs_xl_t *val);

typedef enum {
  LSM6DSR_XL_ODR_OFF    = 0,
  LSM6DSR_XL_ODR_12Hz5  = 1,
  LSM6DSR_XL_ODR_26Hz   = 2,
  LSM6DSR_XL_ODR_52Hz   = 3,
  LSM6DSR_XL_ODR_104Hz  = 4,
  LSM6DSR_XL_ODR_208Hz  = 5,
  LSM6DSR_XL_ODR_417Hz  = 6,
  LSM6DSR_XL_ODR_833Hz  = 7,
  LSM6DSR_XL_ODR_1667Hz = 8,
  LSM6DSR_XL_ODR_3333Hz = 9,
  LSM6DSR_XL_ODR_6667Hz = 10,
  LSM6DSR_XL_ODR_6Hz5   = 11, /* (low power only) */
} lsm6dsr_odr_xl_t;
int32_t lsm6dsr_xl_data_rate_set(lsm6dsr_ctx_t *ctx, lsm6dsr_odr_xl_t val);
int32_t lsm6dsr_xl_data_rate_get(lsm6dsr_ctx_t *ctx, lsm6dsr_odr_xl_t *val);

typedef enum {
  LSM6DSR_125dps = 2,
  LSM6DSR_250dps = 0,
  LSM6DSR_500dps = 4,
  LSM6DSR_1000dps = 8,
  LSM6DSR_2000dps = 12,
  LSM6DSR_4000dps = 1,
} lsm6dsr_fs_g_t;
int32_t lsm6dsr_gy_full_scale_set(lsm6dsr_ctx_t *ctx, lsm6dsr_fs_g_t val);
int32_t lsm6dsr_gy_full_scale_get(lsm6dsr_ctx_t *ctx, lsm6dsr_fs_g_t *val);

typedef enum {
  LSM6DSR_GY_ODR_OFF    = 0,
  LSM6DSR_GY_ODR_12Hz5  = 1,
  LSM6DSR_GY_ODR_26Hz   = 2,
  LSM6DSR_GY_ODR_52Hz   = 3,
  LSM6DSR_GY_ODR_104Hz  = 4,
  LSM6DSR_GY_ODR_208Hz  = 5,
  LSM6DSR_GY_ODR_417Hz  = 6,
  LSM6DSR_GY_ODR_833Hz  = 7,
  LSM6DSR_GY_ODR_1667Hz = 8,
  LSM6DSR_GY_ODR_3333Hz = 9,
  LSM6DSR_GY_ODR_6667Hz = 10,
} lsm6dsr_odr_g_t;
int32_t lsm6dsr_gy_data_rate_set(lsm6dsr_ctx_t *ctx,
                                 lsm6dsr_odr_g_t val);
int32_t lsm6dsr_gy_data_rate_get(lsm6dsr_ctx_t *ctx,
                                 lsm6dsr_odr_g_t *val);

int32_t lsm6dsr_block_data_update_set(lsm6dsr_ctx_t *ctx, uint8_t val);
int32_t lsm6dsr_block_data_update_get(lsm6dsr_ctx_t *ctx, uint8_t *val);

typedef enum {
  LSM6DSR_LSb_1mg  = 0,
  LSM6DSR_LSb_16mg = 1,
} lsm6dsr_usr_off_w_t;
int32_t lsm6dsr_xl_offset_weight_set(lsm6dsr_ctx_t *ctx,
                                     lsm6dsr_usr_off_w_t val);
int32_t lsm6dsr_xl_offset_weight_get(lsm6dsr_ctx_t *ctx,
                                     lsm6dsr_usr_off_w_t *val);

typedef enum {
  LSM6DSR_HIGH_PERFORMANCE_MD  = 0,
  LSM6DSR_LOW_NORMAL_POWER_MD  = 1,
} lsm6dsr_xl_hm_mode_t;
int32_t lsm6dsr_xl_power_mode_set(lsm6dsr_ctx_t *ctx,
                                  lsm6dsr_xl_hm_mode_t val);
int32_t lsm6dsr_xl_power_mode_get(lsm6dsr_ctx_t *ctx,
                                  lsm6dsr_xl_hm_mode_t *val);

typedef enum {
  LSM6DSR_GY_HIGH_PERFORMANCE  = 0,
  LSM6DSR_GY_NORMAL            = 1,
} lsm6dsr_g_hm_mode_t;
int32_t lsm6dsr_gy_power_mode_set(lsm6dsr_ctx_t *ctx,
                                  lsm6dsr_g_hm_mode_t val);
int32_t lsm6dsr_gy_power_mode_get(lsm6dsr_ctx_t *ctx,
                                  lsm6dsr_g_hm_mode_t *val);

typedef struct {
  lsm6dsr_all_int_src_t       all_int_src;
  lsm6dsr_wake_up_src_t       wake_up_src;
  lsm6dsr_tap_src_t           tap_src;
  lsm6dsr_d6d_src_t           d6d_src;
  lsm6dsr_status_reg_t        status_reg;
  lsm6dsr_emb_func_status_t   emb_func_status;
  lsm6dsr_fsm_status_a_t      fsm_status_a;
  lsm6dsr_fsm_status_b_t      fsm_status_b;
  } lsm6dsr_all_sources_t;
int32_t lsm6dsr_all_sources_get(lsm6dsr_ctx_t *ctx,
                                lsm6dsr_all_sources_t *val);

int32_t lsm6dsr_status_reg_get(lsm6dsr_ctx_t *ctx,
                                 lsm6dsr_status_reg_t *val);

int32_t lsm6dsr_xl_flag_data_ready_get(lsm6dsr_ctx_t *ctx, uint8_t *val);

int32_t lsm6dsr_gy_flag_data_ready_get(lsm6dsr_ctx_t *ctx, uint8_t *val);

int32_t lsm6dsr_temp_flag_data_ready_get(lsm6dsr_ctx_t *ctx, uint8_t *val);

int32_t lsm6dsr_xl_usr_offset_x_set(lsm6dsr_ctx_t *ctx, uint8_t *buff);
int32_t lsm6dsr_xl_usr_offset_x_get(lsm6dsr_ctx_t *ctx, uint8_t *buff);

int32_t lsm6dsr_xl_usr_offset_y_set(lsm6dsr_ctx_t *ctx, uint8_t *buff);
int32_t lsm6dsr_xl_usr_offset_y_get(lsm6dsr_ctx_t *ctx, uint8_t *buff);

int32_t lsm6dsr_xl_usr_offset_z_set(lsm6dsr_ctx_t *ctx, uint8_t *buff);
int32_t lsm6dsr_xl_usr_offset_z_get(lsm6dsr_ctx_t *ctx, uint8_t *buff);

int32_t lsm6dsr_xl_usr_offset_set(lsm6dsr_ctx_t *ctx, uint8_t val);
int32_t lsm6dsr_xl_usr_offset_get(lsm6dsr_ctx_t *ctx, uint8_t *val);

int32_t lsm6dsr_timestamp_set(lsm6dsr_ctx_t *ctx, uint8_t val);
int32_t lsm6dsr_timestamp_get(lsm6dsr_ctx_t *ctx, uint8_t *val);

int32_t lsm6dsr_timestamp_raw_get(lsm6dsr_ctx_t *ctx, uint8_t *buff);

typedef enum {
  LSM6DSR_NO_ROUND      = 0,
  LSM6DSR_ROUND_XL      = 1,
  LSM6DSR_ROUND_GY      = 2,
  LSM6DSR_ROUND_GY_XL   = 3,
} lsm6dsr_rounding_t;
int32_t lsm6dsr_rounding_mode_set(lsm6dsr_ctx_t *ctx,
                                  lsm6dsr_rounding_t val);
int32_t lsm6dsr_rounding_mode_get(lsm6dsr_ctx_t *ctx,
                                  lsm6dsr_rounding_t *val);

int32_t lsm6dsr_temperature_raw_get(lsm6dsr_ctx_t *ctx, uint8_t *buff);

int32_t lsm6dsr_angular_rate_raw_get(lsm6dsr_ctx_t *ctx, uint8_t *buff);

int32_t lsm6dsr_acceleration_raw_get(lsm6dsr_ctx_t *ctx, uint8_t *buff);

