LitchiCheng/stm32f103_Combo/LSM6DSR_I2C_HAL/driver/lsm6dsr_reg.h
int32_t lsm6dsr_i3c_disable_set(lsm6dsr_ctx_t *ctx,
                                lsm6dsr_i3c_disable_t val);
int32_t lsm6dsr_i3c_disable_get(lsm6dsr_ctx_t *ctx,
                                lsm6dsr_i3c_disable_t *val);

typedef struct {
    lsm6dsr_int1_ctrl_t          int1_ctrl;
    lsm6dsr_md1_cfg_t            md1_cfg;
    lsm6dsr_emb_func_int1_t      emb_func_int1;
    lsm6dsr_fsm_int1_a_t         fsm_int1_a;
    lsm6dsr_fsm_int1_b_t         fsm_int1_b;
} lsm6dsr_pin_int1_route_t;
int32_t lsm6dsr_pin_int1_route_set(lsm6dsr_ctx_t *ctx,
                                   lsm6dsr_pin_int1_route_t *val);
int32_t lsm6dsr_pin_int1_route_get(lsm6dsr_ctx_t *ctx,
                                   lsm6dsr_pin_int1_route_t *val);

typedef struct {
  lsm6dsr_int2_ctrl_t          int2_ctrl;
  lsm6dsr_md2_cfg_t            md2_cfg;
  lsm6dsr_emb_func_int2_t      emb_func_int2;
  lsm6dsr_fsm_int2_a_t         fsm_int2_a;
  lsm6dsr_fsm_int2_b_t         fsm_int2_b;
} lsm6dsr_pin_int2_route_t;
int32_t lsm6dsr_pin_int2_route_set(lsm6dsr_ctx_t *ctx,
                                   lsm6dsr_pin_int2_route_t *val);
int32_t lsm6dsr_pin_int2_route_get(lsm6dsr_ctx_t *ctx,
                                   lsm6dsr_pin_int2_route_t *val);

typedef enum {
  LSM6DSR_PUSH_PULL   = 0,
  LSM6DSR_OPEN_DRAIN  = 1,
} lsm6dsr_pp_od_t;
int32_t lsm6dsr_pin_mode_set(lsm6dsr_ctx_t *ctx, lsm6dsr_pp_od_t val);
int32_t lsm6dsr_pin_mode_get(lsm6dsr_ctx_t *ctx, lsm6dsr_pp_od_t *val);

typedef enum {
  LSM6DSR_ACTIVE_HIGH = 0,
  LSM6DSR_ACTIVE_LOW  = 1,
} lsm6dsr_h_lactive_t;
int32_t lsm6dsr_pin_polarity_set(lsm6dsr_ctx_t *ctx, lsm6dsr_h_lactive_t val);
int32_t lsm6dsr_pin_polarity_get(lsm6dsr_ctx_t *ctx, lsm6dsr_h_lactive_t *val);

int32_t lsm6dsr_all_on_int1_set(lsm6dsr_ctx_t *ctx, uint8_t val);
int32_t lsm6dsr_all_on_int1_get(lsm6dsr_ctx_t *ctx, uint8_t *val);

typedef enum {
  LSM6DSR_ALL_INT_PULSED            = 0,
  LSM6DSR_BASE_LATCHED_EMB_PULSED   = 1,
  LSM6DSR_BASE_PULSED_EMB_LATCHED   = 2,
  LSM6DSR_ALL_INT_LATCHED           = 3,
} lsm6dsr_lir_t;
int32_t lsm6dsr_int_notification_set(lsm6dsr_ctx_t *ctx, lsm6dsr_lir_t val);
int32_t lsm6dsr_int_notification_get(lsm6dsr_ctx_t *ctx, lsm6dsr_lir_t *val);

typedef enum {
  LSM6DSR_LSb_FS_DIV_64       = 0,
  LSM6DSR_LSb_FS_DIV_256      = 1,
} lsm6dsr_wake_ths_w_t;
int32_t lsm6dsr_wkup_ths_weight_set(lsm6dsr_ctx_t *ctx,
                                    lsm6dsr_wake_ths_w_t val);
int32_t lsm6dsr_wkup_ths_weight_get(lsm6dsr_ctx_t *ctx,
                                    lsm6dsr_wake_ths_w_t *val);

int32_t lsm6dsr_wkup_threshold_set(lsm6dsr_ctx_t *ctx, uint8_t val);
int32_t lsm6dsr_wkup_threshold_get(lsm6dsr_ctx_t *ctx, uint8_t *val);

int32_t lsm6dsr_xl_usr_offset_on_wkup_set(lsm6dsr_ctx_t *ctx,
                                          uint8_t val);
int32_t lsm6dsr_xl_usr_offset_on_wkup_get(lsm6dsr_ctx_t *ctx,
                                          uint8_t *val);

int32_t lsm6dsr_wkup_dur_set(lsm6dsr_ctx_t *ctx, uint8_t val);
int32_t lsm6dsr_wkup_dur_get(lsm6dsr_ctx_t *ctx, uint8_t *val);

int32_t lsm6dsr_gy_sleep_mode_set(lsm6dsr_ctx_t *ctx, uint8_t val);
int32_t lsm6dsr_gy_sleep_mode_get(lsm6dsr_ctx_t *ctx, uint8_t *val);

typedef enum {
  LSM6DSR_DRIVE_SLEEP_CHG_EVENT = 0,
  LSM6DSR_DRIVE_SLEEP_STATUS    = 1,
} lsm6dsr_sleep_status_on_int_t;
int32_t lsm6dsr_act_pin_notification_set(lsm6dsr_ctx_t *ctx,
                                         lsm6dsr_sleep_status_on_int_t val);
int32_t lsm6dsr_act_pin_notification_get(lsm6dsr_ctx_t *ctx,
                                         lsm6dsr_sleep_status_on_int_t *val);

typedef enum {
  LSM6DSR_XL_AND_GY_NOT_AFFECTED      = 0,
  LSM6DSR_XL_12Hz5_GY_NOT_AFFECTED    = 1,
  LSM6DSR_XL_12Hz5_GY_SLEEP           = 2,
  LSM6DSR_XL_12Hz5_GY_PD              = 3,
} lsm6dsr_inact_en_t;
int32_t lsm6dsr_act_mode_set(lsm6dsr_ctx_t *ctx,
                             lsm6dsr_inact_en_t val);
int32_t lsm6dsr_act_mode_get(lsm6dsr_ctx_t *ctx,
                             lsm6dsr_inact_en_t *val);

int32_t lsm6dsr_act_sleep_dur_set(lsm6dsr_ctx_t *ctx, uint8_t val);
int32_t lsm6dsr_act_sleep_dur_get(lsm6dsr_ctx_t *ctx, uint8_t *val);

int32_t lsm6dsr_tap_detection_on_z_set(lsm6dsr_ctx_t *ctx, uint8_t val);
int32_t lsm6dsr_tap_detection_on_z_get(lsm6dsr_ctx_t *ctx, uint8_t *val);

int32_t lsm6dsr_tap_detection_on_y_set(lsm6dsr_ctx_t *ctx, uint8_t val);
int32_t lsm6dsr_tap_detection_on_y_get(lsm6dsr_ctx_t *ctx, uint8_t *val);

int32_t lsm6dsr_tap_detection_on_x_set(lsm6dsr_ctx_t *ctx, uint8_t val);
int32_t lsm6dsr_tap_detection_on_x_get(lsm6dsr_ctx_t *ctx, uint8_t *val);

int32_t lsm6dsr_tap_threshold_x_set(lsm6dsr_ctx_t *ctx, uint8_t val);
int32_t lsm6dsr_tap_threshold_x_get(lsm6dsr_ctx_t *ctx, uint8_t *val);

typedef enum {
  LSM6DSR_XYZ = 0,
  LSM6DSR_YXZ = 1,
  LSM6DSR_XZY = 2,
  LSM6DSR_ZYX = 3,
  LSM6DSR_YZX = 5,
  LSM6DSR_ZXY = 6,
} lsm6dsr_tap_priority_t;
int32_t lsm6dsr_tap_axis_priority_set(lsm6dsr_ctx_t *ctx,
                                      lsm6dsr_tap_priority_t val);
int32_t lsm6dsr_tap_axis_priority_get(lsm6dsr_ctx_t *ctx,
                                      lsm6dsr_tap_priority_t *val);

int32_t lsm6dsr_tap_threshold_y_set(lsm6dsr_ctx_t *ctx, uint8_t val);
int32_t lsm6dsr_tap_threshold_y_get(lsm6dsr_ctx_t *ctx, uint8_t *val);

int32_t lsm6dsr_tap_threshold_z_set(lsm6dsr_ctx_t *ctx, uint8_t val);
int32_t lsm6dsr_tap_threshold_z_get(lsm6dsr_ctx_t *ctx, uint8_t *val);

int32_t lsm6dsr_tap_shock_set(lsm6dsr_ctx_t *ctx, uint8_t val);
int32_t lsm6dsr_tap_shock_get(lsm6dsr_ctx_t *ctx, uint8_t *val);

int32_t lsm6dsr_tap_quiet_set(lsm6dsr_ctx_t *ctx, uint8_t val);
int32_t lsm6dsr_tap_quiet_get(lsm6dsr_ctx_t *ctx, uint8_t *val);

int32_t lsm6dsr_tap_dur_set(lsm6dsr_ctx_t *ctx, uint8_t val);
int32_t lsm6dsr_tap_dur_get(lsm6dsr_ctx_t *ctx, uint8_t *val);

typedef enum {
  LSM6DSR_ONLY_SINGLE        = 0,
  LSM6DSR_BOTH_SINGLE_DOUBLE = 1,
} lsm6dsr_single_double_tap_t;
int32_t lsm6dsr_tap_mode_set(lsm6dsr_ctx_t *ctx,
                             lsm6dsr_single_double_tap_t val);
int32_t lsm6dsr_tap_mode_get(lsm6dsr_ctx_t *ctx,
                             lsm6dsr_single_double_tap_t *val);

