LitchiCheng/stm32f103_Combo/LSM6DSR_I2C_HAL/driver/lsm6dsr_reg.h
typedef enum {
  LSM6DSR_DEG_80  = 0,
  LSM6DSR_DEG_70  = 1,
  LSM6DSR_DEG_60  = 2,
  LSM6DSR_DEG_50  = 3,
} lsm6dsr_sixd_ths_t;
int32_t lsm6dsr_6d_threshold_set(lsm6dsr_ctx_t *ctx,
                                 lsm6dsr_sixd_ths_t val);
int32_t lsm6dsr_6d_threshold_get(lsm6dsr_ctx_t *ctx,
                                 lsm6dsr_sixd_ths_t *val);

int32_t lsm6dsr_4d_mode_set(lsm6dsr_ctx_t *ctx, uint8_t val);
int32_t lsm6dsr_4d_mode_get(lsm6dsr_ctx_t *ctx, uint8_t *val);

typedef enum {
  LSM6DSR_FF_TSH_156mg = 0,
  LSM6DSR_FF_TSH_219mg = 1,
  LSM6DSR_FF_TSH_250mg = 2,
  LSM6DSR_FF_TSH_312mg = 3,
  LSM6DSR_FF_TSH_344mg = 4,
  LSM6DSR_FF_TSH_406mg = 5,
  LSM6DSR_FF_TSH_469mg = 6,
  LSM6DSR_FF_TSH_500mg = 7,
} lsm6dsr_ff_ths_t;
int32_t lsm6dsr_ff_threshold_set(lsm6dsr_ctx_t *ctx,
                                 lsm6dsr_ff_ths_t val);
int32_t lsm6dsr_ff_threshold_get(lsm6dsr_ctx_t *ctx,
                                 lsm6dsr_ff_ths_t *val);

int32_t lsm6dsr_ff_dur_set(lsm6dsr_ctx_t *ctx, uint8_t val);
int32_t lsm6dsr_ff_dur_get(lsm6dsr_ctx_t *ctx, uint8_t *val);

int32_t lsm6dsr_fifo_watermark_set(lsm6dsr_ctx_t *ctx, uint16_t val);
int32_t lsm6dsr_fifo_watermark_get(lsm6dsr_ctx_t *ctx, uint16_t *val);

int32_t lsm6dsr_compression_algo_init_set(lsm6dsr_ctx_t *ctx,
                                          uint8_t val);
int32_t lsm6dsr_compression_algo_init_get(lsm6dsr_ctx_t *ctx,
                                          uint8_t *val);

typedef enum {
  LSM6DSR_CMP_DISABLE  = 0x00,
  LSM6DSR_CMP_ALWAYS   = 0x04,
  LSM6DSR_CMP_8_TO_1   = 0x05,
  LSM6DSR_CMP_16_TO_1  = 0x06,
  LSM6DSR_CMP_32_TO_1  = 0x07,
} lsm6dsr_uncoptr_rate_t;
int32_t lsm6dsr_compression_algo_set(lsm6dsr_ctx_t *ctx,
                                     lsm6dsr_uncoptr_rate_t val);
int32_t lsm6dsr_compression_algo_get(lsm6dsr_ctx_t *ctx,
                                     lsm6dsr_uncoptr_rate_t *val);

int32_t lsm6dsr_fifo_virtual_sens_odr_chg_set(lsm6dsr_ctx_t *ctx,
                                              uint8_t val);
int32_t lsm6dsr_fifo_virtual_sens_odr_chg_get(lsm6dsr_ctx_t *ctx,
                                              uint8_t *val);

int32_t lsm6dsr_compression_algo_real_time_set(lsm6dsr_ctx_t *ctx,
                                               uint8_t val);
int32_t lsm6dsr_compression_algo_real_time_get(lsm6dsr_ctx_t *ctx,
                                               uint8_t *val);

int32_t lsm6dsr_fifo_stop_on_wtm_set(lsm6dsr_ctx_t *ctx, uint8_t val);
int32_t lsm6dsr_fifo_stop_on_wtm_get(lsm6dsr_ctx_t *ctx, uint8_t *val);

typedef enum {
  LSM6DSR_XL_NOT_BATCHED     	=  0,
  LSM6DSR_XL_BATCHED_AT_12Hz5   =  1,
  LSM6DSR_XL_BATCHED_AT_26Hz    =  2,
  LSM6DSR_XL_BATCHED_AT_52Hz    =  3,
  LSM6DSR_XL_BATCHED_AT_104Hz   =  4,
  LSM6DSR_XL_BATCHED_AT_208Hz   =  5,
  LSM6DSR_XL_BATCHED_AT_417Hz   =  6,
  LSM6DSR_XL_BATCHED_AT_833Hz   =  7,
  LSM6DSR_XL_BATCHED_AT_1667Hz  =  8,
  LSM6DSR_XL_BATCHED_AT_3333Hz  =  9,
  LSM6DSR_XL_BATCHED_AT_6667Hz  = 10,
  LSM6DSR_XL_BATCHED_AT_6Hz5    = 11,
} lsm6dsr_bdr_xl_t;
int32_t lsm6dsr_fifo_xl_batch_set(lsm6dsr_ctx_t *ctx, lsm6dsr_bdr_xl_t val);
int32_t lsm6dsr_fifo_xl_batch_get(lsm6dsr_ctx_t *ctx, lsm6dsr_bdr_xl_t *val);

typedef enum {
  LSM6DSR_GY_NOT_BATCHED         = 0,
  LSM6DSR_GY_BATCHED_AT_12Hz5    = 1,
  LSM6DSR_GY_BATCHED_AT_26Hz     = 2,
  LSM6DSR_GY_BATCHED_AT_52Hz     = 3,
  LSM6DSR_GY_BATCHED_AT_104Hz    = 4,
  LSM6DSR_GY_BATCHED_AT_208Hz    = 5,
  LSM6DSR_GY_BATCHED_AT_417Hz    = 6,
  LSM6DSR_GY_BATCHED_AT_833Hz    = 7,
  LSM6DSR_GY_BATCHED_AT_1667Hz   = 8,
  LSM6DSR_GY_BATCHED_AT_3333Hz   = 9,
  LSM6DSR_GY_BATCHED_AT_6667Hz   = 10,
  LSM6DSR_GY_BATCHED_6Hz5        = 11,
} lsm6dsr_bdr_gy_t;
int32_t lsm6dsr_fifo_gy_batch_set(lsm6dsr_ctx_t *ctx, lsm6dsr_bdr_gy_t val);
int32_t lsm6dsr_fifo_gy_batch_get(lsm6dsr_ctx_t *ctx, lsm6dsr_bdr_gy_t *val);

typedef enum {
  LSM6DSR_BYPASS_MODE             = 0,
  LSM6DSR_FIFO_MODE               = 1,
  LSM6DSR_STREAM_TO_FIFO_MODE     = 3,
  LSM6DSR_BYPASS_TO_STREAM_MODE   = 4,
  LSM6DSR_STREAM_MODE             = 6,
  LSM6DSR_BYPASS_TO_FIFO_MODE     = 7,
} lsm6dsr_fifo_mode_t;
int32_t lsm6dsr_fifo_mode_set(lsm6dsr_ctx_t *ctx, lsm6dsr_fifo_mode_t val);
int32_t lsm6dsr_fifo_mode_get(lsm6dsr_ctx_t *ctx, lsm6dsr_fifo_mode_t *val);

typedef enum {
  LSM6DSR_TEMP_NOT_BATCHED        = 0,
  LSM6DSR_TEMP_BATCHED_AT_52Hz    = 1,
  LSM6DSR_TEMP_BATCHED_AT_12Hz5   = 2,
  LSM6DSR_TEMP_BATCHED_AT_1Hz6    = 3,
} lsm6dsr_odr_t_batch_t;
int32_t lsm6dsr_fifo_temp_batch_set(lsm6dsr_ctx_t *ctx,
                                    lsm6dsr_odr_t_batch_t val);
int32_t lsm6dsr_fifo_temp_batch_get(lsm6dsr_ctx_t *ctx,
                                    lsm6dsr_odr_t_batch_t *val);

typedef enum {
  LSM6DSR_NO_DECIMATION = 0,
  LSM6DSR_DEC_1         = 1,
  LSM6DSR_DEC_8         = 2,
  LSM6DSR_DEC_32        = 3,
} lsm6dsr_odr_ts_batch_t;
int32_t lsm6dsr_fifo_timestamp_decimation_set(lsm6dsr_ctx_t *ctx,
                                              lsm6dsr_odr_ts_batch_t val);
int32_t lsm6dsr_fifo_timestamp_decimation_get(lsm6dsr_ctx_t *ctx,
                                              lsm6dsr_odr_ts_batch_t *val);

typedef enum {
  LSM6DSR_XL_BATCH_EVENT   = 0,
  LSM6DSR_GYRO_BATCH_EVENT = 1,
} lsm6dsr_trig_counter_bdr_t;
int32_t lsm6dsr_fifo_cnt_event_batch_set(lsm6dsr_ctx_t *ctx,
                                         lsm6dsr_trig_counter_bdr_t val);
int32_t lsm6dsr_fifo_cnt_event_batch_get(lsm6dsr_ctx_t *ctx,
                                         lsm6dsr_trig_counter_bdr_t *val);

int32_t lsm6dsr_rst_batch_counter_set(lsm6dsr_ctx_t *ctx, uint8_t val);
int32_t lsm6dsr_rst_batch_counter_get(lsm6dsr_ctx_t *ctx, uint8_t *val);

int32_t lsm6dsr_batch_counter_threshold_set(lsm6dsr_ctx_t *ctx,
                                            uint16_t val);
int32_t lsm6dsr_batch_counter_threshold_get(lsm6dsr_ctx_t *ctx,
                                            uint16_t *val);

int32_t lsm6dsr_fifo_data_level_get(lsm6dsr_ctx_t *ctx, uint16_t *val);

int32_t lsm6dsr_fifo_status_get(lsm6dsr_ctx_t *ctx,
                                lsm6dsr_fifo_status2_t *val);

int32_t lsm6dsr_fifo_full_flag_get(lsm6dsr_ctx_t *ctx, uint8_t *val);

int32_t lsm6dsr_fifo_ovr_flag_get(lsm6dsr_ctx_t *ctx, uint8_t *val);

int32_t lsm6dsr_fifo_wtm_flag_get(lsm6dsr_ctx_t *ctx, uint8_t *val);

